cities = [
    "Архангельск", "Барнаул", "Балашиха", "Волгоград", "Екатеринбург", "Иркутск", "Краснодар", "Красноярск",
    "Нижний Новгород", "Новосибирск", "Оренбург", "Пермь", "Самара", "Саратов", "Санкт-Петербург", "Сургут",
    "Тюмень", "Уфа", "Челябинск", "Нижневартовск", "Ноябрьск", "Тобольск", "Ханты-Мансийск"
]

dealerships = {
    'AODES': [
    "Оренбург", "Тобольск", "Новосибирск", "Красноярск", "Челябинск", "Сургут",
    "Ноябрьск", "Тюмень", "Екатеринбург", "Нижневартовск", "Иркутск"
],
    'Stels': cities,
    'Русская механика': ['Сургут', 'Нижневартовск', 'Ноябрьск'],
    'VOGE': ['Тюмень', 'Тобольск']
}

city_to_full_address = {
    "Архангельск": "Архангельская обл., Архангельск, ул. Смольный Буян",
    "Барнаул": "Алтайский край, Барнаул, пл. Советов",
    "Балашиха": "Московская область, Балашиха, проспект Ленина",
    "Волгоград": "Волгоградская обл., Волгоград, ул. Рокоссовского",
    "Екатеринбург": "Свердловская обл., Екатеринбург, Селькоровская ул.",
    "Иркутск": "Иркутская обл., Иркутск, ул. Рабочего Штаба",
    "Краснодар": "Краснодарский край, Краснодар, Новороссийская ул.",
    "Красноярск": "Красноярский край, Красноярск, Караульная ул.",
    "Нижневартовск": "Ханты-Мансийский автономный округ, Нижневартовск, Северная ул.",
    "Нижний Новгород": "Нижегородская обл., Нижний Новгород, ул. Лейтенанта Шмидта",
    "Новосибирск": "Новосибирская обл., Новосибирск, ул. Немировича-Данченко",
    "Ноябрьск": "Ямало-Ненецкий автономный округ, Ноябрьск, мкр-н П-6",
    "Оренбург": "Оренбургская обл., Оренбург, ул. Монтажников",
    "Пермь": "Пермский край, Пермь, ул. Лифанова",
    "Самара": "Самарская обл., Самара, Алма-Атинская ул.",
    "Саратов": "Саратовская обл., Саратов, Большая Долинная ул.",
    "Санкт-Петербург": "Санкт-Петербург, пр-т Большевиков",
    "Сургут": "Ханты-Мансийский автономный округ, Сургут, Быстринская ул.",
    "Тобольск": "Тюменская обл., Тобольск, 2-й квартал",
    "Тюмень": "Тюменская обл., Тюмень, ул. Тимофея Чаркова",
    "Уфа": "Республика Башкортостан, Уфа",
    "Ханты-Мансийск": "Ханты-Мансийский автономный округ, Ханты-Мансийск, ул. Энгельса",
    "Челябинск": "Челябинская обл., Челябинск, Троицкий тракт"
}